meeting/minutes/2022/10-25.org
:PROPERTIES:
:ID:       58AE1E31-3759-4157-AE45-E579086127A3
:END:
#+title: QT4 CG Meeting 008 Minutes 2022-10-25
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

* Draft Minutes
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: minutes
:END:

* Summary of new and continuing actions [0/6]
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: new-actions
:END:

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-005-03: RD to review the variadic functions proposal in #197 (formerly #166)
+ [ ] QT4CG-007-05: NW to make an issue for Martin’s proposed ammendment to map:build
+ [ ] QT4CG-008-01: MK to review RD’s comments on PR #202
+ [ ] QT4CG-008-02: NW to review MKs comments on PR #215
+ [ ] QT4CG-008-03: MK to make a PR for issue #96, starts|ends-with-sequence

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call [10/13]
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

Regrets: BTW, JK expected at [0:15]

+ [X] Anthony (Tony) Bufort (AB)
+ [X] Reece Dunn (RD)
+ [X] Christian Grün (CG)
+ [X] Joel Kalvesmaki (JK) [0:15-]
+ [X] Michael Kay (MK)
+ [X] John Lumley (JL)
+ [X] Dimitre Novatchev (DN)
+ [X] Ed Porter (EP) 
+ [ ] Liam Quin (LQ)
+ [ ] Adam Retter
+ [X] C. M. Sperberg-McQueen (MSM)
+ [ ] Bethan Tovey-Walsh (BTW)
+ [X] Norm Tovey-Walsh (NW). /Chair/. /Scribe/.

** Accept the agenda
:PROPERTIES:
:CUSTOM_ID: agenda
:END:

Proposal: Accept [[../../agenda/2022/10-25.html][the agenda]].

Accepted.

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

The next meeting [[../../agenda/2022/11-01.html][is scheduled for Tuesday, 1 November]]. Any regrets?

Note well: next week, the United Kingdom and Europe will no longer be
on daylight saving time. Please confirm the meeting time in your time
zone!

+ DN: I may have to leave at half past the hour.

** Approve minutes of the previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Proposal: Accept [[../../minutes/2022/10-18.html][the minutes of the previous meeting]].

Accepted.

** Review of open action items [4/7]
:PROPERTIES:
:CUSTOM_ID: review-of-actions
:END:

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-005-03: RD to review the variadic functions proposal in #197 (formerly #166)
  + Reviewed the previous version; just started looking at it from the updated revision
  + I have noticed that PR contains various other commits (NW thinks this is rebasing)
+ [X] QT4CG-008-01: MK to implement the resolution of issue #165 (“:=” and no “$”)
  + Absorbed into the current version of the variadic proposal
+ [X] QT4CG-008-02: NW to fix or replace #199, it doesn’t reflect the original correctly
  + https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0046.html
+ [X] QT4CG-008-03: NW to make the GitHub PR link to the diffs
  + Automation withdrawn, https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0047.html
+ [X] QT4CG-008-04: RD to review pull request #202
  + Completed.
+ [ ] QT4CG-008-05: NW to make an issue for Martin’s proposed ammendment to map:build
  + Continued

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** Review pull request #197 (was 166; variadic functions)
:PROPERTIES:
:CUSTOM_ID: pr-variadic-functions
:END:

+ See [[https://qt4cg.org/#pr-197][pull request #197]] (you’ll find links to formatted versions of the specs at [[https://qt4cg.org/]]).
+ See also the nexus of issues [[https://github.com/qt4cg/qtspecs/issues/162][#162]], [[https://github.com/qt4cg/qtspecs/issues/161][#161]], [[https://github.com/qt4cg/qtspecs/issues/160][#160]], [[https://github.com/qt4cg/qtspecs/issues/159][#159]], [[https://github.com/qt4cg/qtspecs/issues/158][#158]], [[https://github.com/qt4cg/qtspecs/issues/157][#157]], and [[https://github.com/qt4cg/qtspecs/issues/155][#155]].
+ See the discussion from [[../../minutes/2022/10-11.html#pr-variadic-functions][two weeks ago]] and [[../../minutes/2022/10-18.html#pr-variadic-functions][last week]].

Anything to discuss today?

+ MK: There’s been useful feedback: minor technical corrections and editorial suggestions.
  + I think I can implement those and make a draft everyone will accept
+ MSM: The rules for binding arguments to parameters say something to
  the effect that at such-and-such a point all the arguments will be
  optional, but that’s not true.
+ MK: Yes, we need a new rule that says that’s an error.
+ MSM: I’d like to read it one more time.

MK will update the PR to address feedback.

The expectation is that we’ll have a proposal we can all accept by
next week and we’ll propose to accept it. Please review it before the
meeting.

