meeting/minutes/2022/10-25.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 008 Minutes 2022-10-25</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 008 Minutes 2022-10-25</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#minutes">Minutes</a></li>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/6]</code></a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[10/13]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#next-meeting">1.3. Next meeting</a></li>
<li><a href="#approve-minutes">1.4. Approve minutes of the previous meeting</a></li>
<li><a href="#review-of-actions">1.5. Review of open action items <code>[4/7]</code></a></li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical Agenda</a>
<ul>
<li><a href="#pr-variadic-functions">2.1. Review pull request #197 (was 166; variadic functions)</a></li>
<li><a href="#pr-items-before">2.2. Review pull request #199 (was 177; items before, etc.)</a></li>
<li><a href="#pr-subtyping">2.3. Review pull request #202 (was 196; subtyping)</a></li>
<li><a href="#pr-fn-qname">2.4. Review pull request #207: new fn:QName#1 variant</a></li>
<li><a href="#pr-typeswitch">2.5. Review pull request #217</a></li>
<li><a href="#pr-parse-uri">2.6. Review pull request #215</a></li>
<li><a href="#issue-96">2.7. Issue #96, starting/ending sequence functions</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>

<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Minutes</h2>
<div class="outline-text-2" id="text-minutes">
<p>
Approved <a href="./11-01.html">at meeting 009</a> on 1 November 2022.
</p>
</div>
</div>

<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/6]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-005-03: RD to review the variadic functions proposal in #197 (formerly #166)</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-007-05: NW to make an issue for Martin’s proposed ammendment to map:build</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-008-01: MK to review RD’s comments on PR #202</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-008-02: NW to review MKs comments on PR #215</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-008-03: MK to make a PR for issue #96, starts|ends-with-sequence</li>
</ul>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[10/13]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: BTW, JK expected at [0:15]
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Anthony (Tony) Bufort (AB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK) [0:15-]</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> John Lumley (JL)</li>
<li class="on"><code>[X]</code> Dimitre Novatchev (DN)</li>
<li class="on"><code>[X]</code> Ed Porter (EP)</li>
<li class="off"><code>[&#xa0;]</code> Liam Quin (LQ)</li>
<li class="off"><code>[&#xa0;]</code> Adam Retter</li>
<li class="on"><code>[X]</code> C. M. Sperberg-McQueen (MSM)</li>
<li class="off"><code>[&#xa0;]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW). <i>Chair</i>. <i>Scribe</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2022/10-25.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.3.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting <a href="../../agenda/2022/11-01.html">is scheduled for Tuesday, 1 November</a>. Any regrets?
</p>

<p>
Note well: next week, the United Kingdom and Europe will no longer be
on daylight saving time. Please confirm the meeting time in your time
zone!
</p>

<ul class="org-ul">
<li>DN: I may have to leave at half past the hour.</li>
</ul>
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.4.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2022/10-18.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-review-of-actions" class="outline-3">
<h3 id="review-of-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[4/7]</code></h3>
<div class="outline-text-3" id="text-review-of-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-005-03: RD to review the variadic functions proposal in #197 (formerly #166)
<ul class="org-ul">
<li>Reviewed the previous version; just started looking at it from the updated revision</li>
<li>I have noticed that PR contains various other commits (NW thinks this is rebasing)</li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-008-01: MK to implement the resolution of issue #165 (“:=” and no “$”)
<ul class="org-ul">
<li>Absorbed into the current version of the variadic proposal</li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-008-02: NW to fix or replace #199, it doesn’t reflect the original correctly
<ul class="org-ul">
<li><a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0046.html">https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0046.html</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-008-03: NW to make the GitHub PR link to the diffs
<ul class="org-ul">
<li>Automation withdrawn, <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0047.html">https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0047.html</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-008-04: RD to review pull request #202
<ul class="org-ul">
<li>Completed.</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-008-05: NW to make an issue for Martin’s proposed ammendment to map:build
<ul class="org-ul">
<li>Continued</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-pr-variadic-functions" class="outline-3">
<h3 id="pr-variadic-functions"><span class="section-number-3">2.1.</span> Review pull request #197 (was 166; variadic functions)</h3>
<div class="outline-text-3" id="text-pr-variadic-functions">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/#pr-197">pull request #197</a> (you’ll find links to formatted versions of the specs at <a href="https://qt4cg.org/">https://qt4cg.org/</a>).</li>
<li>See also the nexus of issues <a href="https://github.com/qt4cg/qtspecs/issues/162">#162</a>, <a href="https://github.com/qt4cg/qtspecs/issues/161">#161</a>, <a href="https://github.com/qt4cg/qtspecs/issues/160">#160</a>, <a href="https://github.com/qt4cg/qtspecs/issues/159">#159</a>, <a href="https://github.com/qt4cg/qtspecs/issues/158">#158</a>, <a href="https://github.com/qt4cg/qtspecs/issues/157">#157</a>, and <a href="https://github.com/qt4cg/qtspecs/issues/155">#155</a>.</li>
<li>See the discussion from <a href="../../minutes/2022/10-11.html#pr-variadic-functions">two weeks ago</a> and <a href="../../minutes/2022/10-18.html#pr-variadic-functions">last week</a>.</li>
</ul>

<p>
Anything to discuss today?
</p>

<ul class="org-ul">
<li>MK: There’s been useful feedback: minor technical corrections and editorial suggestions.
<ul class="org-ul">
<li>I think I can implement those and make a draft everyone will accept</li>
</ul></li>
<li>MSM: The rules for binding arguments to parameters say something to
the effect that at such-and-such a point all the arguments will be
optional, but that’s not true.</li>
<li>MK: Yes, we need a new rule that says that’s an error.</li>
<li>MSM: I’d like to read it one more time.</li>
</ul>

<p>
MK will update the PR to address feedback.
</p>

<p>
The expectation is that we’ll have a proposal we can all accept by
next week and we’ll propose to accept it. Please review it before the
meeting.
</p>
</div>
</div>
