meeting/minutes/2022/10-25.org
** Review pull request #199 (was 177; items before, etc.)
:PROPERTIES:
:CUSTOM_ID: pr-items-before
:END:

+ See [[https://qt4cg.org/#pr-199][pull request #199]]
+ Updated by NW to correct the errors [[../../minutes/2022/10-18.html#pr-items-before][observed last week]].

Mike gives a brief tour, scrolls through the diffs to F&O.

+ MK: We’re proposing ~fn:items-before()~, ~fn:items-after()~,
  ~fn:items-starting-where()~ and ~fn:items-ending-where()~
  + … Minor typo, ~fn:items-after()~ uses ~fn:items-before()~ in an
    example.
+ RD: Where these say “the function then returns”, that could be misinterpreted. 
+ MSM: It kind of has to be that way because we first define ~$P~.

Agreement that both paragraphs are connected.

+ MK: These functions are all obviously very similar.
+ JL: Am I correct in thinking the difference between the ‘where’ and
  ‘before’ and ‘after’ versions from before is whether the boundary is
  included or not?
+ MK: Yes.
+ CG: I had a fairly general comment in the original issue [[https://github.com/qt4cg/qtspecs/issues/149][#149]]. I
  note that many languages have functions ~take-while()~ and
  ~drop-while()~ that do more or less the same thing. My basic
  question is, do we need to reinvent the wheel, or would there be
  value in using the existing function names and semantics?
+ MK: Sometimes names from other lanaguages just don’t fit our
  conventions at all. I don’t see any particular problems with
  ~take-while()~ and ~drop-while()~ except that they don’t immediately
  suggest ot me where the boundary condition is.
+ MSM: I like names that are noun-phrases, not verb phrases.
+ MK: We do have some function names that are imperative verbs…we aren’t consistent.
+ MSM: Yes, but when faced with a choice…

Proposal: accept these with the correction to the example?

Accepted.

** Review pull request #202 (was 196; subtyping)
:PROPERTIES:
:CUSTOM_ID: pr-subtyping
:END:

+ See [[https://qt4cg.org/#pr-202][pull request #202]]

Mike reviews.

+ MK: This primarily affects the XPath spec and text that’s common to XQuery.
  + … This is essentially editorial, straying into technical choices about how things are stated.
  + … It doesn’t change any of the semantics.
  + … Main purpose was to clarify the presentaiton of the subtyping rules.
  + … Also fixing a bug raised against 3.1 in terms of a reliance on
    things having a most specific dynamic type which isn’t true for
    functions, for example.
  + … Trying to get rid of the reference to the dynamic type of a
    value; it doesn’t compare the type, it just determines if the
    sequence type matches.

Some discussion of how the phrase “this is a subtype of” relates to
the comparision of types and the comparison of values with types.

+ MK: In 3.6.2, we see some new defined terms used.
  + … Added reference to the subtyping rules
  + … The main thing in 3.7 is that the very long list of 35 bullet
    points has been expanded into subsections with headers and
    examples. I’ve also introduced some notation to try to make the
    charts clearer. (Not usefully presented in the diff!)
  + … It assumes we’re going to agree enumeration types
  + … If I’ve got it right, none of the rules have changed!
+ RD: I’ve included these in my reviews, but in the section on union
  type matching, I found it confusing. There’s an example of where two
  types can be different because of the union member ordering. I think
  you meant to swap one of the type member orderings because they’re
  the same order but you have the cast as…
+ MK: Yes, I remember you pointing that out…
+ RD: I’m referring to section 3.7; in the second note about subtype
  not being acyclic. The two unions are the same, I think you meant to
  flip one of them.
+ MK: Yes, I think that’s right.
+ RD: I also tried to make the wording a bit clearer in my review
  comments. I also have some comments about a couple of bugs that
  might be in the general rules.
+ MK: Give me an action to review RD’s comments on this proposal.

ACTION QT4CG-008-01: MK to review RD’s comments on PR #202

Note from scribe: what follows is a bit confused; MSM was having
issues with audio so this is partly transcribed from chat and partly
read out from chat.

+ MSM: I am concerned about the assumption that all atomic types which
  contain a given atomic value have a meet (greatest lower bound)
  which is in the type lattice. That may be true (I think it is but
  haven't thought much) for the built-ins, but it is not guaranteed
  for all schema-defined atomic types
+ MK: I think the point here is that it relates to the discussion we
  just had on one of the GitHub reviews. We’re never concerned about
  whether or not type contains a value. They’re constructed with a
  particular type. The fact that a value would be valuid as an
  =xs:short= for example, is irrelevant if it’s constructed as an
  =xs:positiveInteger=. It’s not an instance of an =xs:short= even if it
  would validate as one!
+ MSM: For atomic values in particular, there is always one dynamic
  type that is specifically associated with the value, so we can refer
  to the dynamic type of an atomic value without ambiguity; this will
  be a subtype of all the other types that it matches.
+ MK: I think that’s true.
+ MSM: That’s from the dynamic evalutaion phase.

We’ll come back to this next week.

