meeting/minutes/2022/10-25.html

<div id="outline-container-pr-items-before" class="outline-3">
<h3 id="pr-items-before"><span class="section-number-3">2.2.</span> Review pull request #199 (was 177; items before, etc.)</h3>
<div class="outline-text-3" id="text-pr-items-before">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/#pr-199">pull request #199</a></li>
<li>Updated by NW to correct the errors <a href="../../minutes/2022/10-18.html#pr-items-before">observed last week</a>.</li>
</ul>

<p>
Mike gives a brief tour, scrolls through the diffs to F&amp;O.
</p>

<ul class="org-ul">
<li>MK: We’re proposing <code>fn:items-before()</code>, <code>fn:items-after()</code>,
<code>fn:items-starting-where()</code> and <code>fn:items-ending-where()</code>
<ul class="org-ul">
<li>… Minor typo, <code>fn:items-after()</code> uses <code>fn:items-before()</code> in an
example.</li>
</ul></li>
<li>RD: Where these say “the function then returns”, that could be misinterpreted.</li>
<li>MSM: It kind of has to be that way because we first define <code>$P</code>.</li>
</ul>

<p>
Agreement that both paragraphs are connected.
</p>

<ul class="org-ul">
<li>MK: These functions are all obviously very similar.</li>
<li>JL: Am I correct in thinking the difference between the ‘where’ and
‘before’ and ‘after’ versions from before is whether the boundary is
included or not?</li>
<li>MK: Yes.</li>
<li>CG: I had a fairly general comment in the original issue <a href="https://github.com/qt4cg/qtspecs/issues/149">#149</a>. I
note that many languages have functions <code>take-while()</code> and
<code>drop-while()</code> that do more or less the same thing. My basic
question is, do we need to reinvent the wheel, or would there be
value in using the existing function names and semantics?</li>
<li>MK: Sometimes names from other lanaguages just don’t fit our
conventions at all. I don’t see any particular problems with
<code>take-while()</code> and <code>drop-while()</code> except that they don’t immediately
suggest ot me where the boundary condition is.</li>
<li>MSM: I like names that are noun-phrases, not verb phrases.</li>
<li>MK: We do have some function names that are imperative verbs…we aren’t consistent.</li>
<li>MSM: Yes, but when faced with a choice…</li>
</ul>

<p>
Proposal: accept these with the correction to the example?
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr-subtyping" class="outline-3">
<h3 id="pr-subtyping"><span class="section-number-3">2.3.</span> Review pull request #202 (was 196; subtyping)</h3>
<div class="outline-text-3" id="text-pr-subtyping">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/#pr-202">pull request #202</a></li>
</ul>

<p>
Mike reviews.
</p>

<ul class="org-ul">
<li>MK: This primarily affects the XPath spec and text that’s common to XQuery.
<ul class="org-ul">
<li>… This is essentially editorial, straying into technical choices about how things are stated.</li>
<li>… It doesn’t change any of the semantics.</li>
<li>… Main purpose was to clarify the presentaiton of the subtyping rules.</li>
<li>… Also fixing a bug raised against 3.1 in terms of a reliance on
things having a most specific dynamic type which isn’t true for
functions, for example.</li>
<li>… Trying to get rid of the reference to the dynamic type of a
value; it doesn’t compare the type, it just determines if the
sequence type matches.</li>
</ul></li>
</ul>

<p>
Some discussion of how the phrase “this is a subtype of” relates to
the comparision of types and the comparison of values with types.
</p>

<ul class="org-ul">
<li>MK: In 3.6.2, we see some new defined terms used.
<ul class="org-ul">
<li>… Added reference to the subtyping rules</li>
<li>… The main thing in 3.7 is that the very long list of 35 bullet
points has been expanded into subsections with headers and
examples. I’ve also introduced some notation to try to make the
charts clearer. (Not usefully presented in the diff!)</li>
<li>… It assumes we’re going to agree enumeration types</li>
<li>… If I’ve got it right, none of the rules have changed!</li>
</ul></li>
<li>RD: I’ve included these in my reviews, but in the section on union
type matching, I found it confusing. There’s an example of where two
types can be different because of the union member ordering. I think
you meant to swap one of the type member orderings because they’re
the same order but you have the cast as…</li>
<li>MK: Yes, I remember you pointing that out…</li>
<li>RD: I’m referring to section 3.7; in the second note about subtype
not being acyclic. The two unions are the same, I think you meant to
flip one of them.</li>
<li>MK: Yes, I think that’s right.</li>
<li>RD: I also tried to make the wording a bit clearer in my review
comments. I also have some comments about a couple of bugs that
might be in the general rules.</li>
<li>MK: Give me an action to review RD’s comments on this proposal.</li>
</ul>

<p>
ACTION QT4CG-008-01: MK to review RD’s comments on PR #202
</p>

<p>
Note from scribe: what follows is a bit confused; MSM was having
issues with audio so this is partly transcribed from chat and partly
read out from chat.
</p>

<ul class="org-ul">
<li>MSM: I am concerned about the assumption that all atomic types which
contain a given atomic value have a meet (greatest lower bound)
which is in the type lattice. That may be true (I think it is but
haven't thought much) for the built-ins, but it is not guaranteed
for all schema-defined atomic types</li>
<li>MK: I think the point here is that it relates to the discussion we
just had on one of the GitHub reviews. We’re never concerned about
whether or not type contains a value. They’re constructed with a
particular type. The fact that a value would be valuid as an
<code>xs:short</code> for example, is irrelevant if it’s constructed as an
<code>xs:positiveInteger</code>. It’s not an instance of an <code>xs:short</code> even if it
would validate as one!</li>
<li>MSM: For atomic values in particular, there is always one dynamic
type that is specifically associated with the value, so we can refer
to the dynamic type of an atomic value without ambiguity; this will
be a subtype of all the other types that it matches.</li>
<li>MK: I think that’s true.</li>
<li>MSM: That’s from the dynamic evalutaion phase.</li>
</ul>

<p>
We’ll come back to this next week.
</p>
</div>
</div>
