meeting/minutes/2022/10-25.org
** Review pull request #207: new fn:QName#1 variant
:PROPERTIES:
:CUSTOM_ID: pr-fn-qname
:END:

+ See [[https://qt4cg.org/#pr-207][pull request #207]]

Mike continues to drive…

+ MK: We exend the semantics of =fn:QName= to take one or two arguments.
  + … When we have the proposal on variadic functions accepted, we’ll
    still have two functions because the arguments are different
  + … This departs from our usual precedent that the different
    fucntions have corresponding arguments and some are defaulted.
  + … In this case, the *meaning* of the first argument is different between the two variants
  + … The two argument form is unchanged.
  + … the single argument form is new and does what it says. In
    particular, it provides a way to build QNames from EQNames.
+ JL: Since this is effectivley two different functions that produce
  the same type output, I’m not sure they should have the same name.
  It’s counter to what we’ve done before. I’d have =qName-from-EQName=
  for the first one. Otherwise, what do you do with currying on the
  first argument?
+ MK: I think it’s just so conveneint to be able to construct a QName
  from an NCName or an EQName with a function calle =fn:QName= that
  any other name seems contorted.
+ RD: Can’t you do the first two bits from ~xs:QName~?
+ MK: Yes, but I thought it was convenient here to have one function that does it all
  + … One, because it’s eaier to remember
  + … Two, you don’t want to have to work out what kind of input you have before you decide what to call.
+ RD: Couldn’t we have ~fn:parseQName()~, consistent with ~fn:parseXML()~?
+ MK: We could do that.
+ RD: That would make it clearer what it’s doing. I think of
  ~fn:QName~ as constructing a QName given an namespace URI and a
  local name.

In chat, JK gives +1 to the suggestion. MSM agrees.

+ DN: Isn’t this what an ~xs:QName()~ constructor does?
+ MK: We don’t have a constructor for the EQName string.
+ DN: Can’t we redefine the constructor?
+ MK: No, it has to be consistent with XSD.

Consensus leans towards two functions. No one objects.

Proposal: Address the single argument functionality with a new function named ~fn:parseQName()~.

Accepted.

Mike will submit a PR. If we get a couple of approvals and no
objections after a couple of days, we’ll regard it as accepted and
merge it without further discussion next week.

** Review pull request #217
:PROPERTIES:
:CUSTOM_ID: pr-typeswitch
:END:

+ See [[https://github.com/qt4cg/qtspecs/pull/217][pull request #217]]

+ MK: This fixes a bug in the grammar.

Proposal: Accept this PR.

Accepted.

+ DN: Why are all the specs changed?
+ NW: They aren’t; it’s impossible to tell what specs will be changed,
  so we have to build them all.

** Review pull request #215
:PROPERTIES:
:CUSTOM_ID: pr-parse-uri
:END:

+ See [[https://qt4cg.org/#pr-215][pull request #215]]

+ MK: What’s the status here? I made some comments…
+ NW: Apologies, I missed them.

ACTION QT4CG-008-02: NW to review MKs comments on PR #215

** Issue #96, starting/ending sequence functions
:PROPERTIES:
:CUSTOM_ID: issue-96
:END:

MK [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html][proposes]] that [[https://github.com/qt4cg/qtspecs/issues/96][this issue]] may be ready to be decided.

+ DN: This is a sequence generalization of the string functions
  ~fn:starts-with()~ and ~fn:ends-with()~. I’ve provided an
  implementation for all the exmples in pure XPath. Everything should
  be clear. I think these are useful convenience functions.
+ MK: Any reason not to include a contains sequence function?
+ DN: There is [[https://github.com/qt4cg/qtspecs/issues/94][another issue]] about that because there are questions
  about contiguous or not-contiguious subsequences.
+ DN: I thought that when we were are looking at the argument types
  question, we could have at least a flag that says treat a string as a
  sequence of codepoints. If we had this, then we could have just
  these functions on sequences.
+ RD: That wouldn’t work for collations.
+ MK: It would only work for the Unicode codepoint collation.

Some discussion of the names.

JK: This could be useful if we’re really going to introduce composite keys in maps. It’d be easy to check in a key.

ACTION QT4CG-008-03: MK to make a PR for issue #96, starts|ends-with-sequence

+ DN: I want to draw your attention to the compare argument which
  probably we could think about having a better default after we have
  decided about options on the ~fn:deep-equal()~ function. We want
  this function to return false and not raise an error.
+ MK: We can do that by using ~fn:deep-equal~ and using partial apply.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

+ JL: Heads up, in two weeks time at least three of us will be at [[https://declarative.amsterdam/][Declarative Amsterdam]].
