meeting/minutes/2022/10-25.html

<div id="outline-container-pr-fn-qname" class="outline-3">
<h3 id="pr-fn-qname"><span class="section-number-3">2.4.</span> Review pull request #207: new fn:QName#1 variant</h3>
<div class="outline-text-3" id="text-pr-fn-qname">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/#pr-207">pull request #207</a></li>
</ul>

<p>
Mike continues to drive…
</p>

<ul class="org-ul">
<li>MK: We exend the semantics of <code>fn:QName</code> to take one or two arguments.
<ul class="org-ul">
<li>… When we have the proposal on variadic functions accepted, we’ll
still have two functions because the arguments are different</li>
<li>… This departs from our usual precedent that the different
fucntions have corresponding arguments and some are defaulted.</li>
<li>… In this case, the <b>meaning</b> of the first argument is different between the two variants</li>
<li>… The two argument form is unchanged.</li>
<li>… the single argument form is new and does what it says. In
particular, it provides a way to build QNames from EQNames.</li>
</ul></li>
<li>JL: Since this is effectivley two different functions that produce
the same type output, I’m not sure they should have the same name.
It’s counter to what we’ve done before. I’d have <code>qName-from-EQName</code>
for the first one. Otherwise, what do you do with currying on the
first argument?</li>
<li>MK: I think it’s just so conveneint to be able to construct a QName
from an NCName or an EQName with a function calle <code>fn:QName</code> that
any other name seems contorted.</li>
<li>RD: Can’t you do the first two bits from <code>xs:QName</code>?</li>
<li>MK: Yes, but I thought it was convenient here to have one function that does it all
<ul class="org-ul">
<li>… One, because it’s eaier to remember</li>
<li>… Two, you don’t want to have to work out what kind of input you have before you decide what to call.</li>
</ul></li>
<li>RD: Couldn’t we have <code>fn:parseQName()</code>, consistent with <code>fn:parseXML()</code>?</li>
<li>MK: We could do that.</li>
<li>RD: That would make it clearer what it’s doing. I think of
<code>fn:QName</code> as constructing a QName given an namespace URI and a
local name.</li>
</ul>

<p>
In chat, JK gives +1 to the suggestion. MSM agrees.
</p>

<ul class="org-ul">
<li>DN: Isn’t this what an <code>xs:QName()</code> constructor does?</li>
<li>MK: We don’t have a constructor for the EQName string.</li>
<li>DN: Can’t we redefine the constructor?</li>
<li>MK: No, it has to be consistent with XSD.</li>
</ul>

<p>
Consensus leans towards two functions. No one objects.
</p>

<p>
Proposal: Address the single argument functionality with a new function named <code>fn:parseQName()</code>.
</p>

<p>
Accepted.
</p>

<p>
Mike will submit a PR. If we get a couple of approvals and no
objections after a couple of days, we’ll regard it as accepted and
merge it without further discussion next week.
</p>
</div>
</div>

<div id="outline-container-pr-typeswitch" class="outline-3">
<h3 id="pr-typeswitch"><span class="section-number-3">2.5.</span> Review pull request #217</h3>
<div class="outline-text-3" id="text-pr-typeswitch">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/pull/217">pull request #217</a></li>

<li>MK: This fixes a bug in the grammar.</li>
</ul>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>

<ul class="org-ul">
<li>DN: Why are all the specs changed?</li>
<li>NW: They aren’t; it’s impossible to tell what specs will be changed,
so we have to build them all.</li>
</ul>
</div>
</div>

<div id="outline-container-pr-parse-uri" class="outline-3">
<h3 id="pr-parse-uri"><span class="section-number-3">2.6.</span> Review pull request #215</h3>
<div class="outline-text-3" id="text-pr-parse-uri">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/#pr-215">pull request #215</a></li>

<li>MK: What’s the status here? I made some comments…</li>
<li>NW: Apologies, I missed them.</li>
</ul>

<p>
ACTION QT4CG-008-02: NW to review MKs comments on PR #215
</p>
</div>
</div>

<div id="outline-container-issue-96" class="outline-3">
<h3 id="issue-96"><span class="section-number-3">2.7.</span> Issue #96, starting/ending sequence functions</h3>
<div class="outline-text-3" id="text-issue-96">
<p>
MK <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html">proposes</a> that <a href="https://github.com/qt4cg/qtspecs/issues/96">this issue</a> may be ready to be decided.
</p>

<ul class="org-ul">
<li>DN: This is a sequence generalization of the string functions
<code>fn:starts-with()</code> and <code>fn:ends-with()</code>. I’ve provided an
implementation for all the exmples in pure XPath. Everything should
be clear. I think these are useful convenience functions.</li>
<li>MK: Any reason not to include a contains sequence function?</li>
<li>DN: There is <a href="https://github.com/qt4cg/qtspecs/issues/94">another issue</a> about that because there are questions
about contiguous or not-contiguious subsequences.</li>
<li>DN: I thought that when we were are looking at the argument types
question, we could have at least a flag that says treat a string as a
sequence of codepoints. If we had this, then we could have just
these functions on sequences.</li>
<li>RD: That wouldn’t work for collations.</li>
<li>MK: It would only work for the Unicode codepoint collation.</li>
</ul>

<p>
Some discussion of the names.
</p>

<p>
JK: This could be useful if we’re really going to introduce composite keys in maps. It’d be easy to check in a key.
</p>

<p>
ACTION QT4CG-008-03: MK to make a PR for issue #96, starts|ends-with-sequence
</p>

<ul class="org-ul">
<li>DN: I want to draw your attention to the compare argument which
probably we could think about having a better default after we have
decided about options on the <code>fn:deep-equal()</code> function. We want
this function to return false and not raise an error.</li>
<li>MK: We can do that by using <code>fn:deep-equal</code> and using partial apply.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<ul class="org-ul">
<li>JL: Heads up, in two weeks time at least three of us will be at <a href="https://declarative.amsterdam/">Declarative Amsterdam</a>.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
